# LoadSet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalEquipmentLoadData..::..LoadSet Property
AnalyticalEquipmentLoadData Class See Also
---
The electrical analytical load set of the analytical equipment load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ElementId LoadSet { get; set; }
```

Visual Basic
---
```text
Public Property LoadSet As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ LoadSet {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Remarks
invalidElementId if the analytical equipment load does not belong to any analytical load sets.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given element id loadSetId is neither a load set id nor invalidElementId. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace